app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "A title"], ["body", "Great body"], ["created_at", "2015-06-03 20:42:50.034370"], ["updated_at", "2015-06-03 20:42:50.034370"]]
---
  def create
    # debugger
    @post = Post.new(post_params)
    @post.save